#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform

Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

The remote workspace is configured to work with configuration at
terraform-cloudflare relative to the target repository.

Terraform will upload the contents of the following directory,
excluding files or directories as defined by a .terraformignore file
at /home/runner/work/homelab/homelab/.terraformignore (if it is present),
in order to capture the filesystem context the remote workspace expects:
    /home/runner/work/homelab/homelab

To view this run in a browser, visit:
https://app.terraform.io/app/mrugesh/tfws-ops-cloudflare/runs/run-eSbmy5pci4qadztb

Waiting for the plan to start...

Terraform v1.4.6
on linux_amd64
Initializing plugins and modules...
cloudflare_record.hello-a-192-168-2-100: Refreshing state... [id=350c202b8be3226f9372954ff83f49bb]
cloudflare_record.spf-txt: Refreshing state... [id=d224977486785d3c29c7d642626f107d]
cloudflare_record.root-a: Refreshing state... [id=0e10e169dfbca6384ce29066a378e941]
cloudflare_zone.mrugesh-net: Refreshing state... [id=70e283865beebe3ee051946d4a80dffa]
cloudflare_record.dmarc-txt: Refreshing state... [id=bf94ca689e4ebe39c9340e2d4e7faf13]
cloudflare_record.pve-a-192-168-2-10: Refreshing state... [id=7465033431233dbfb688f2338d811856]
cloudflare_record.www-cname-mrugesh-net: Refreshing state... [id=a3e2cafb14089aef9e0bfc97d1a5bdf5]
cloudflare_record.hello-a-192-168-2-100: Drift detected (update)

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # cloudflare_record.hello-a-192-168-2-100 will be destroyed
  # (because cloudflare_record.hello-a-192-168-2-100 is not in configuration)
  - resource "cloudflare_record" "hello-a-192-168-2-100" {
      - allow_overwrite = false -> null
      - created_on      = "2023-05-10T14:50:11.413067Z" -> null
      - hostname        = "hello.mrugesh.net" -> null
      - id              = "350c202b8be3226f9372954ff83f49bb" -> null
      - metadata        = {
          - "auto_added"             = "false"
          - "managed_by_apps"        = "false"
          - "managed_by_argo_tunnel" = "false"
          - "source"                 = "primary"
        } -> null
      - modified_on     = "2023-05-10T14:50:11.413067Z" -> null
      - name            = "hello" -> null
      - proxiable       = false -> null
      - proxied         = false -> null
      - tags            = [] -> null
      - ttl             = 1 -> null
      - type            = "A" -> null
      - value           = "192.168.2.100" -> null
      - zone_id         = (sensitive value) -> null
    }

  # cloudflare_record.hello-a-192-168-2-200 will be created
  + resource "cloudflare_record" "hello-a-192-168-2-200" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "hello"
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = 1
      + type            = "A"
      + value           = "192.168.2.200"
      + zone_id         = (sensitive value)
    }

Plan: 1 to add, 0 to change, 1 to destroy.

```

</details>

*Pushed by: @raisedadead, Action: `pull_request`*